In [3]:
import pandas as pd
var = pd.DataFrame({'a':[1,2,3,4,5],'b':[6,7,8,9,10]})
print(var)

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [7]:
var['c']=var['a']+var['b']
var

   a   b   c
0  1   6   7
1  2   7   9
2  3   8  11
3  4   9  13
4  5  10  15

In [9]:
var['c']=var['a']-var['b']
var

   a   b  c
0  1   6 -5
1  2   7 -5
2  3   8 -5
3  4   9 -5
4  5  10 -5

In [11]:
var['c']=var['a']*var['b']
var

   a   b   c
0  1   6   6
1  2   7  14
2  3   8  24
3  4   9  36
4  5  10  50

In [13]:
var['c']=var['a']/var['b']
var

   a   b         c
0  1   6  0.166667
1  2   7  0.285714
2  3   8  0.375000
3  4   9  0.444444
4  5  10  0.500000

In [17]:
import pandas as pd
var1 = pd.DataFrame({'a':[10,20,30,4,5],'b':[6,70,80,9,10]})
print(var1)

    a   b
0  10   6
1  20  70
2  30  80
3   4   9
4   5  10

In [21]:
var['Python']= var['a']>=30
var['Python']= var['b']<=30

var

    a   b  Python
0  10   6    True
1  20  70   False
2  30  80   False
3   4   9    True
4   5  10    True

In [1]:
import pandas as pd
var = pd.DataFrame({'x':[1,2,3,4,5],'y':[3,4,5,6,7]})
print(var)

   x  y
0  1  3
1  2  4
2  3  5
3  4  6
4  5  7

In [18]:
#var.insert(1,'u',var['x'])
var.insert(1,'v',[10,20,30,40,50])

var

   x   v  u  z  y
0  1  10  1  1  3
1  2  20  2  2  4
2  3  30  3  3  5
3  4  40  4  4  6
4  5  50  5  5  7

In [ ]:
var['s']=var['a']

In [22]:
var['s'] = var['z'][:3]
var

   x   v  u  z  y    s
0  1  10  1  1  3  1.0
1  2  20  2  2  4  2.0
2  3  30  3  3  5  3.0
3  4  40  4  4  6  NaN
4  5  50  5  5  7  NaN

In [24]:
import pandas as pd
var = pd.DataFrame({'a':[10,20,30,4,5],'b':[6,70,80,9,10],'c':[11,23,4,56,78]})
print(var)

    a   b   c
0  10   6  11
1  20  70  23
2  30  80   4
3   4   9  56
4   5  10  78

In [28]:
var1 = var.pop('b')
var1

0     6
1    70
2    80
3     9
4    10
Name: b, dtype: int64

In [30]:
var

    a   c
0  10  11
1  20  23
2  30   4
3   4  56
4   5  78

In [32]:
del var['c']
var

    a
0  10
1  20
2  30
3   4
4   5

In [38]:
#csv files
import pandas as pd
dis = {'x':[1,2,3,4,5],'y':[2,3,4,5,6],'y':[3,4,5,6,7]}
d = pd.DataFrame(dis)
print(d)
d.to_csv('Test_new.csv', index = False)

   x  y
0  1  3
1  2  4
2  3  5
3  4  6
4  5  7

In [42]:
import pandas as pd
dis = {'x':[1,2,3,4,5],'y':[2,3,4,5,6],'y':[3,4,5,6,7]}
d = pd.DataFrame(dis)
csv_1 = pd.read_csv("C:\\Users\\hp\\Desktop\\pandas\\Test_new.csv")
csv_1

   x  y
0  1  3
1  2  4
2  3  5
3  4  6
4  5  7

In [47]:
csv_2 = pd.read_csv("C:\\Users\\hp\\Desktop\\pandas\\Test_new.csv", nrows = 2)
csv_2

   x  y
0  1  3
1  2  4

In [55]:
csv_3 = pd.read_csv("C:\\Users\\hp\\Desktop\\pandas\\Test_new.csv", usecols = [1] )
csv_3

   y
0  3
1  4
2  5
3  6
4  7

In [57]:
csv_5 = pd.read_csv("C:\\Users\\hp\\Desktop\\pandas\\Test_new.csv", skiprows = 2)
csv_5

   2  4
0  3  5
1  4  6
2  5  7

In [59]:
csv_2 = pd.read_csv("C:\\Users\\hp\\Desktop\\pandas\\Test_new.csv", names = ['bili','deet'])
csv_2

  bili deet
0    x    y
1    1    3
2    2    4
3    3    5
4    4    6
5    5    7

In [7]:
import pandas as pd
csv_6 = pd.read_csv("C:\\Users\\hp\\Desktop\\pandas\\Test_new.csv")
csv_6

   x  y
0  1  3
1  2  4
2  3  5
3  4  6
4  5  7

In [11]:
csv_6.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
csv_6.columns

Index(['x', 'y'], dtype='object')

In [19]:
csv_6.describe()

              x         y
count  5.000000  5.000000
mean   3.000000  5.000000
std    1.581139  1.581139
min    1.000000  3.000000
25%    2.000000  4.000000
50%    3.000000  5.000000
75%    4.000000  6.000000
max    5.000000  7.000000

In [21]:
csv_6.head(2)

   x  y
0  1  3
1  2  4

In [23]:
csv_6.tail(2)

   x  y
3  4  6
4  5  7

In [25]:
csv_6[1:3]

   x  y
1  2  4
2  3  5

In [27]:
print(type(csv_6))

<class 'pandas.core.frame.DataFrame'>

In [29]:
csv_6.index.array

<NumpyExtensionArray>
[0, 1, 2, 3, 4]
Length: 5, dtype: int64

In [39]:
csv_6.to_numpy()

array([[1, 3],
       [2, 4],
       [3, 5],
       [4, 6],
       [5, 7]], dtype=int64)

In [41]:
import numpy as np
v = np.asarray(csv_6)
v

array([[1, 3],
       [2, 4],
       [3, 5],
       [4, 6],
       [5, 7]], dtype=int64)

In [47]:
csv_6.sort_index(axis = 0, ascending = False)

   x  y
4  5  7
3  4  6
2  3  5
1  2  4
0  1  3

In [51]:
csv_6.loc[0]

x    1
y    3
Name: 0, dtype: int64

In [55]:
csv_6.iloc[0,1]

3